load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: "/register"
          json:
            username: "testuser{{ $randomInt }}"
            email: "test{{ $randomInt }}@example.com"
            password: "password123"
      - post:
          url: "/login"
          json:
            email: "test{{ $randomInt }}@example.com"
            password: "password123"
      - get:
          url: "/payments"
          headers:
            Authorization: "Bearer {{ token }}"